7767517
113 126
Input            input.1                  0 1 input.1
Convolution      Conv_0                   1 1 input.1 523 0=64 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=1728
PReLU            PRelu_1                  1 1 523 337 0=64
ConvolutionDepthWise Conv_2                   1 1 337 526 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
PReLU            PRelu_3                  1 1 526 341 0=64
Convolution      Conv_4                   1 1 341 529 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8192
PReLU            PRelu_5                  1 1 529 345 0=128
ConvolutionDepthWise Conv_6                   1 1 345 532 0=128 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
PReLU            PRelu_7                  1 1 532 349 0=128
Convolution      Conv_8                   1 1 349 535 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8192
Split            splitncnn_0              1 2 535 535_splitncnn_0 535_splitncnn_1
Convolution      Conv_9                   1 1 535_splitncnn_1 538 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8192
PReLU            PRelu_10                 1 1 538 355 0=128
ConvolutionDepthWise Conv_11                  1 1 355 541 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
PReLU            PRelu_12                 1 1 541 359 0=128
Convolution      Conv_13                  1 1 359 544 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8192
BinaryOp         Add_14                   2 1 535_splitncnn_0 544 362 0=0
Split            splitncnn_1              1 2 362 362_splitncnn_0 362_splitncnn_1
Convolution      Conv_15                  1 1 362_splitncnn_1 547 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8192
PReLU            PRelu_16                 1 1 547 366 0=128
ConvolutionDepthWise Conv_17                  1 1 366 550 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
PReLU            PRelu_18                 1 1 550 370 0=128
Convolution      Conv_19                  1 1 370 553 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8192
BinaryOp         Add_20                   2 1 362_splitncnn_0 553 373 0=0
Split            splitncnn_2              1 2 373 373_splitncnn_0 373_splitncnn_1
Convolution      Conv_21                  1 1 373_splitncnn_1 556 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8192
PReLU            PRelu_22                 1 1 556 377 0=128
ConvolutionDepthWise Conv_23                  1 1 377 559 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
PReLU            PRelu_24                 1 1 559 381 0=128
Convolution      Conv_25                  1 1 381 562 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8192
BinaryOp         Add_26                   2 1 373_splitncnn_0 562 384 0=0
Split            splitncnn_3              1 2 384 384_splitncnn_0 384_splitncnn_1
Convolution      Conv_27                  1 1 384_splitncnn_1 565 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8192
PReLU            PRelu_28                 1 1 565 388 0=128
ConvolutionDepthWise Conv_29                  1 1 388 568 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
PReLU            PRelu_30                 1 1 568 392 0=128
Convolution      Conv_31                  1 1 392 571 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8192
BinaryOp         Add_32                   2 1 384_splitncnn_0 571 395 0=0
Convolution      Conv_33                  1 1 395 574 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
PReLU            PRelu_34                 1 1 574 399 0=256
ConvolutionDepthWise Conv_35                  1 1 399 577 0=256 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=2304 7=256
PReLU            PRelu_36                 1 1 577 403 0=256
Convolution      Conv_37                  1 1 403 580 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
Split            splitncnn_4              1 2 580 580_splitncnn_0 580_splitncnn_1
Convolution      Conv_38                  1 1 580_splitncnn_1 583 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
PReLU            PRelu_39                 1 1 583 409 0=256
ConvolutionDepthWise Conv_40                  1 1 409 586 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304 7=256
PReLU            PRelu_41                 1 1 586 413 0=256
Convolution      Conv_42                  1 1 413 589 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
BinaryOp         Add_43                   2 1 580_splitncnn_0 589 416 0=0
Split            splitncnn_5              1 2 416 416_splitncnn_0 416_splitncnn_1
Convolution      Conv_44                  1 1 416_splitncnn_1 592 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
PReLU            PRelu_45                 1 1 592 420 0=256
ConvolutionDepthWise Conv_46                  1 1 420 595 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304 7=256
PReLU            PRelu_47                 1 1 595 424 0=256
Convolution      Conv_48                  1 1 424 598 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
BinaryOp         Add_49                   2 1 416_splitncnn_0 598 427 0=0
Split            splitncnn_6              1 2 427 427_splitncnn_0 427_splitncnn_1
Convolution      Conv_50                  1 1 427_splitncnn_1 601 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
PReLU            PRelu_51                 1 1 601 431 0=256
ConvolutionDepthWise Conv_52                  1 1 431 604 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304 7=256
PReLU            PRelu_53                 1 1 604 435 0=256
Convolution      Conv_54                  1 1 435 607 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
BinaryOp         Add_55                   2 1 427_splitncnn_0 607 438 0=0
Split            splitncnn_7              1 2 438 438_splitncnn_0 438_splitncnn_1
Convolution      Conv_56                  1 1 438_splitncnn_1 610 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
PReLU            PRelu_57                 1 1 610 442 0=256
ConvolutionDepthWise Conv_58                  1 1 442 613 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304 7=256
PReLU            PRelu_59                 1 1 613 446 0=256
Convolution      Conv_60                  1 1 446 616 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
BinaryOp         Add_61                   2 1 438_splitncnn_0 616 449 0=0
Split            splitncnn_8              1 2 449 449_splitncnn_0 449_splitncnn_1
Convolution      Conv_62                  1 1 449_splitncnn_1 619 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
PReLU            PRelu_63                 1 1 619 453 0=256
ConvolutionDepthWise Conv_64                  1 1 453 622 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304 7=256
PReLU            PRelu_65                 1 1 622 457 0=256
Convolution      Conv_66                  1 1 457 625 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
BinaryOp         Add_67                   2 1 449_splitncnn_0 625 460 0=0
Split            splitncnn_9              1 2 460 460_splitncnn_0 460_splitncnn_1
Convolution      Conv_68                  1 1 460_splitncnn_1 628 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
PReLU            PRelu_69                 1 1 628 464 0=256
ConvolutionDepthWise Conv_70                  1 1 464 631 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304 7=256
PReLU            PRelu_71                 1 1 631 468 0=256
Convolution      Conv_72                  1 1 468 634 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
BinaryOp         Add_73                   2 1 460_splitncnn_0 634 471 0=0
Convolution      Conv_74                  1 1 471 637 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
PReLU            PRelu_75                 1 1 637 475 0=512
ConvolutionDepthWise Conv_76                  1 1 475 640 0=512 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=4608 7=512
PReLU            PRelu_77                 1 1 640 479 0=512
Convolution      Conv_78                  1 1 479 643 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
Split            splitncnn_10             1 2 643 643_splitncnn_0 643_splitncnn_1
Convolution      Conv_79                  1 1 643_splitncnn_1 646 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
PReLU            PRelu_80                 1 1 646 485 0=256
ConvolutionDepthWise Conv_81                  1 1 485 649 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304 7=256
PReLU            PRelu_82                 1 1 649 489 0=256
Convolution      Conv_83                  1 1 489 652 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
BinaryOp         Add_84                   2 1 643_splitncnn_0 652 492 0=0
Split            splitncnn_11             1 2 492 492_splitncnn_0 492_splitncnn_1
Convolution      Conv_85                  1 1 492_splitncnn_1 655 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
PReLU            PRelu_86                 1 1 655 496 0=256
ConvolutionDepthWise Conv_87                  1 1 496 658 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304 7=256
PReLU            PRelu_88                 1 1 658 500 0=256
Convolution      Conv_89                  1 1 500 661 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
BinaryOp         Add_90                   2 1 492_splitncnn_0 661 503 0=0
Convolution      Conv_91                  1 1 503 664 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
PReLU            PRelu_92                 1 1 664 507 0=512
ConvolutionDepthWise Conv_93                  1 1 507 667 0=512 1=7 11=7 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=25088 7=512
Reshape          Reshape_99               1 1 667 517 0=-1
InnerProduct     MatMul_100               1 1 517 519 0=512 1=0 2=262144
BatchNorm        BatchNormalization_101   1 1 519 520 0=512
Split            splitncnn_12             1 2 520 520_splitncnn_0 520_splitncnn_1
Reduction        ReduceL2_102             1 1 520_splitncnn_1 521 0=8 1=0 -23303=1,1 4=1
BinaryOp         Div_103                  2 1 520_splitncnn_0 521 522 0=3
